---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ServerInternalException
source: html/04efd490-11ad-d53a-8fda-f9878f2b5079.htm
---
# ServerInternalException Methods

Retrieves data needed to serialize the target object.